Core/src/Documents/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаИнформационноеОбслуживаниеНалогоплательщика</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУслуги</name>
    <type>
      <types>EnumRef.ВидыУслугПриИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОтвета</name>
    <type>
      <types>EnumRef.ФорматОтветаНаЗапросИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставленияСправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйПараметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматЗапроса</name>
    <type>
      <types>EnumRef.ФорматыДокументооборотаСФНС</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНалогов</name>
    <type>
      <types>EnumRef.КоличествоНалоговДляСверкиИОН</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапрашиваемыеНалоги</name>
    <attributes>
      <name>КБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОКАТО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Налог</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ФорматОтветаНаЗапросИОН/ФорматОтветаНаЗапросИОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматОтветаНаЗапросИОН</name>
  <enumValues>
    <name>TXT</name>
  </enumValues>
  <enumValues>
    <name>PDF</name>
  </enumValues>
  <enumValues>
    <name>RTF</name>
  </enumValues>
  <enumValues>
    <name>XML</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>УдалитьXLS</name>
  </enumValues>
  <enumValues>
    <name>XLS</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика/Forms/ФормаВыбораФорматаОтвета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ФорматОтвета) Тогда
		ФорматОтвета = XMLСтрока(Параметры.ФорматОтвета);
	Иначе
		ФорматОтвета = Перечисления.ФорматОтветаНаЗапросИОН.PDF;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Результат = ПредопределенноеЗначение("Перечисление.ФорматОтветаНаЗапросИОН." + ФорматОтвета);
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
